MEXICO/V6-Run4/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



interpolationScheme cellPoint;
  
  setFormat       raw;
  sets
  (
      ProfileEnd
      {
          type   uniform; //cloud;
         axis    z; // xyz;
        start (425 10 0);
        end   (425 10 118);
        nPoints  1000;
      }


  );
  
  fields          ( 
                   U
                   k
                  ); 
